GroundLRR/0/R
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      R;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0); 
boundaryField
{
    Side
    {
        type            empty;
    }
    Inlet
    {
        type            inletOutlet;
        inletValue      uniform (3.2082792000000005e-8 0 0 3.2082792000000005e-8 0 6.416558400000001e-08);// /XX XY XZ YX YY YZ ZZ/
    }
    Airfoil
    {
        type            kqRWallFunction;
        value           uniform (0 0 0 0 0 0); 
    }
    Ground
    {
        type            kqRWallFunction;
        value           uniform (0 0 0 0 0 0); 
    }
    Outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
