GroundLRR/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];


internalField   uniform 0.5629094789408697; 

boundaryField
{ 

     Inlet
    {
      type              inletOutlet;
      inletValue        $internalField;
    }

    Outlet
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }
    
    Airfoil
    {
        type            epsilonWallFunction;
        blended         true;
        value           $internalField;
    }
    Ground
    {
        type            epsilonWallFunction;
        blended         true;
        value           $internalField;
    }
}


// ************************************************************************* //
