GroundLRR/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 6.416558400000001e-08; // 

boundaryField
{
    Inlet
    {
      type             inletOutlet; 
      inletValue       uniform 6.416558400000001e-08;
    }

    Outlet
    {
      type              zeroGradient;
    }


    Side
    {
        type            empty;
    }

    Airfoil
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }
    Ground
    {
        type            kqRWallFunction;
        value           uniform 0.;
    }

}

// ************************************************************************* //
