GroundLRR/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;

    limited         cellLimited Gauss linear 1;
    grad(U)         $limited;
    grad(k)         $limited;
    grad(omega)     $limited;
}

divSchemes
{
    default         none;

    div(phi,U)      bounded Gauss linearUpwind limited;
    div(phi,k)      bounded Gauss linearUpwind limited;
    div(phi,omega)  bounded Gauss linearUpwind limited;
    div(phi,epsilon) bounded Gauss linearUpwind limited;
    div(phi,R)      bounded Gauss linearUpwind limited;
    div(phi,e)      bounded Gauss linearUpwind limited;
    div(phi,K)      bounded Gauss linearUpwind limited;
    div(phi,Ekp)    bounded Gauss linearUpwind limited;

    div(phid,p)     bounded Gauss linearUpwind limited;
    div((phi|interpolate(rho)),p)  bounded Gauss linearUpwind limited;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(((rho*(thermo:mu|rho))*dev2(T(grad(U))))) Gauss linear;
    div((rho*R)) Gauss linear;
     
}

laplacianSchemes
{
    default         Gauss linear limited corrected 0.33; //corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited corrected 0.33; //corrected;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
